#คำนวณหาภาษีที่ต้องจ่าย และเงินเดือนสุทธิของพนักงานแล้วแสดงผลทางหน้า โดยรับค่ารหัสพนักหนังาน ชื่อพนักงานและเงินเดือนปกติของพนักงานทางแป้นพิมพ์
#ทั้งนี้เงินเดือนสุทธิของพนักงานนั้นจะต้องหักภาษีและเบี้ยประกันสังคมออกจากเงินเดือนปกติเสียก่อนโดยที่พนักงานต้องเสียภาษี 7% ของเงินเดือนปกติและจ่ายค่าเบี้ยประกันสังคม 500
#ขอ 5 ฟังก์ชัน ดังนั้นต้องหาให้ได้ 5 feture
#================================================
#             คำนวณเงินเดือนพนักงาน
#================================================
#ป้อนรหัสพนักงาน : <input>
#ป้อนชื่อพนักงาน : <input>
#ป้อนเงินเดือนปกติ : <input>
#================================================
#ภาษีเป็นเงิน : <output> บาท (ขอทศนิยม 2 ตำแหน่ง)
#เงินเดือนสุทธิ :<output> บาท (ขอทศนิยม 2 ตำแหน่ง)
#================================================

def A():
    id = input("ป้อนรหัสพนักงาน : ")
    name= input("ป้อนชื่อพนักงาน : ")
    ml=float(input("ป้อนเงินปกติของพนักงาน"))
    return id, name, ml
def B(ml):
    pc=7
    tax=(ml*pc)/100
    return tax
def C():
    ssf=500
    return ssf
def D(ml, tax,ssf):
    ns=ml-tax-ssf
    return ns
def E(id,name,ml,tax,ssf,ns):
    print(f"ป้อนรหัสพนักงาน :{id}")
    print(f"ป้อนชื่อพนักงาน :{name}")
    print(f"ป้อนเงินเดือนพนักงาน :{ml:.2f}")
    print(f"ภาษีเงิน :{tax:.2f}")
    print(f"เบื้ยประกันสังคม :{ssf:.2f}")
    print(f"เงินเดือนสุทธิ :{ns:.2f}")
print("==========================================")
print("=========คำนวณเงินเดือนพนักงาน==============")
print("==========================================")
id,name,ml = A()
print("==========================================")
tax = B(ml)
ssf=C()
ns=D(ml,tax,ssf)
E(id,name,ml,tax,ssf,ns)
print("==========================================")